{
  "data": {
    "name": "Julian Murphy",
    "profession": "Backend Developer",
    "address": "Buenos Aires - Argentina.",
    "email": "njmdistrisoft@gmail.com",
    "website": "",
    "phone": "(+54) 29xxxxxxx-x",
    "avatar": "https://avatars.githubusercontent.com/u/9388504?v=4",
    "profile": "Desarrollador de software y administrador de sistemas. Actualmente desarrollador en Trocafone dentro del 谩rea de ventas/ecommerce, integraci贸n con otros marketplaces, procesamientos de pagos y facturaci贸n.",
    "certificate": [
      {
        "date": "Dic 2018",
        "description": "GIS and IDE (Qgis)",
        "institution": "Universidad Nacional de Avellaneda",
        "name": "FrontEnd Developer"
      },
      {
        "date": "2021",
        "description": "3rd position in optimization. Ci-Vi is a platform for networking and gaining certified work experience. Self sovereign identity in blockchain. React Native Application Demo",
        "institution": "DiDi - IdentiHack Project",
        "name": "Backend Developer"
      }
    ],
    "academic": [
      {
        "degree": "Tec. System Administration and free software",
        "description": "Tesis: Telegram bot for remote server managment, resources metrics and download logs. Tech: Django, Docker and Python",
        "endDate": "Jan 2019",
        "institution": "Universidad Nacional del Comahue",
        "startDate": "Jan 2017"
      }
    ],
    "experience": [
      {
        "company": "Trocafone",
        "endDate": "Present",
        "jobDescription": "Desarrollo del sitio web ecommerce en Laravel, jQuery y javascript con integraciones a microservicios desarrollados en python y NodeJs para procesar pagos y ventas de marketplaces exteriores.",
        "jobTitle": "Software developer",
        "startDate": "Aug 2021"
      },
      {
        "company": "TWGroup SpA",
        "endDate": "Aug 2021",
        "jobDescription": "Desarrollo de software a medida. Mayormente, desarrollos en PHP (Laravel) y Jquery/Javascript. L铆der de proyecto en desarrollo para Lex de estudio jur铆dico. Desarrollo en Laravel con LiveWire y AlpineJS para ecommerce ProLibro abierto a librer铆as de todo Chile. Desarrollo de m贸dulo de emisi贸n y control de documentos electr贸nicos (facturaci贸n) para integraci贸n con el SII de Chile. Deploy de servicios de facturaci贸n y ERPs, construcci贸n y mantenimiento de im谩genes docker. Entre otros proyectos mencionados tambi茅n se encuentran: ERP personalizado, reportes en sistemas preexistentes, marketplaces para pymes",
        "jobTitle": "Software developer",
        "startDate": "Oct 2020"
      },
      {
        "company": "Tribunal de Cuentas de la Provincia de R铆o Negro",
        "endDate": "2021",
        "jobDescription": "Desarrollo de sistema de expedientes web con backend en Laravel y sistema de stock en Yii Framework junto con un equipo de frontend que desarrolla en Angular. A cargo de desarrollar una aplicaci贸n desktop en Java para firma digital de documentos PDF integrados al sistema de expedientes. Soporte para tokens de firma digital (HSM a trav茅s del est谩ndar PKCS11). Implementaci贸n de arquitectura SSO (single sign on) mediante el uso de Keycloak integrado con LDAP. Administrador de sistemas, mayormente automatizando tareas a trav茅s de scripting bash y python. Soluciones para el equipo interconectando sistemas con sensores (bot de telegram, GLPI, sensores de humedad y temperatura para datacenter, entre otros). Llev茅 a cabo la implementaci贸n de proxmox, migraci贸n de m谩quinas virtuales KVM, creaci贸n de contenedores LXC. Desarrollo de im谩genes propias de Docker multi stage para servicios brindados en el organismo. Mantenimiento de los servidores, gesti贸n b谩sica de equipos de red como MikroTik y switchs. Administraci贸n de servicios como SAMBA, Squid, IRC, OpenLDAP, etc.",
        "jobTitle": "Software developer / Sysadmin",
        "startDate": "2018"
      },
      {
        "company": "Universidad Nacional del Comahue",
        "endDate": "Present",
        "jobDescription": "Desarrollo de aplicaciones afines al 谩mbito universitario. Principalmente desarrolladas en Yii Framework (PHP). Construcci贸n de ambientes docker y mantenimiento del sistema de workflow para programas de c谩tedra. Desarrollo de m贸dulo de b煤squeda de carreras y presentaci贸n de los planes en ReactJS para el sitio web oficial web.curza.uncoma.edu.ar. Configuraci贸n de equipos de redes como router MikroTik, switchs Cisco y TP-Link, access points de Unifi y Ubiquiti y su controladora. Apoyo en el dise帽o de vlans, conexi贸n con otras sedes, entre otras tareas de networking.",
        "jobTitle": "Software developer / Sysadmin",
        "startDate": "2018"
      },
      {
        "company": "Desarrollos Tello",
        "endDate": "Present",
        "jobDescription": "Desarrollo de aplicaci贸n web en Laravel PHP para c谩lculo de cr茅ditos. Proyecto VotarOnline, utilizado en diferentes cooperativas del pa铆s para llevar la votaci贸n correspondiente en medio de la pandemia. Pruebas de estr茅s con JMeter y mejoras de performance en c贸digo. Implementaci贸n de colas de eventos con redis. Mantenimiento de sitios Wordpress y configuraciones con Woocommerce. Administraci贸n de servidores, scripting para backups y configuraci贸n de Github Actions, autodeploy de los cambios.",
        "jobTitle": "Software developer / Sysadmin",
        "startDate": "2017"
      },
      {
        "company": "Alessandro Leonardo",
        "endDate": "Present",
        "jobDescription": "Desarrollo de sitios webs a partir de mockups propios del dise帽ador mencionado como referencia. Soluciones de m煤ltiples p谩ginas web para venta en l铆nea con Woocommerce. Administraci贸n de servidores en cloud",
        "jobTitle": "Software developer / Sysadmin",
        "startDate": "2019"
      },
      {
        "company": "Cooperativa Obrera Ltda.",
        "endDate": "2016",
        "jobDescription": "Instalaci贸n y configuraci贸n de servidores GNU/Linux para renovar los equipos de cada sucursal. Mantenimiento de redes y gesti贸n de equipos de comunicaci贸n. Utilidad de registro para control de MACAddress con base de datos no relacional (redis).",
        "jobTitle": "Sysadmin",
        "startDate": "2016"
      }

    ],
    "skills": [
      {
        "name": "PHP",
        "percentage": "85%"
      },
      {
        "name": "CSS",
        "percentage": "25%"
      },
      {
        "name": "JavaScript",
        "percentage": "50%"
      },
      {
        "name": "React",
        "percentage": "40%"
      },
      {
        "name": "GNU/Linux",
        "percentage": "70%"
      },
      {
        "name": "Python",
        "percentage": "60%"
      }
    ],
    "interest": [
      "javascript",
      "develop",
      "backend",
      "frontend",
      "python",
      "kubernetes",
      "containers",
      "IA"
    ],
    "languages": [
      {
        "name": "Spanish",
        "percentage": "90%"
      },
      {
        "name": "Portuguese",
        "percentage": "40%"
      },
      {
        "name": "English",
        "percentage": "20%"
      }
    ],
    "social": [
      {
        "name": "github",
        "url": "https://github.com/fkmurphy"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/njulianmurphy"
      }
    ]
  }
}
