{
  "data": {
    "name": "Melissa Walsh",
    "profession": "FrontEnd Developer",
    "address": "Bogotá, Colombia.",
    "email": "melissa@example.com",
    "website": "https://example.com",
    "phone": "3042034240",
    "avatar": "https://arepa.s3.amazonaws.com/melissa.jpg",
    "profile": "I am a Front end engineer who loves working on building web applications, either from scratch or with production code. My strong skill is for Javascript, either backend or front end. Today I can effortlessly work on technologies like HTML, CSS, Vanilla Javascript, TypeScript, Git/Github, Webpack, Pug, SASS, Jest, RxJs, Angular, Vue, React, and many others that help me build web applications that are maintainable and scalable.",
    "certificate": [
      {
        "date": "Jan 2021",
        "description": "Hack up furballs try to jump onto window and fall while scratching at wall. ",
        "institution": "Platzi",
        "name": "FrontEnd Developer"
      },
      {
        "date": "Jan 2021",
        "description": "Scratch at the door then walk away wack the mini furry mouse",
        "institution": "Platzi",
        "name": "Backend Developer"
      }
    ],
    "academic": [
      {
        "title": "Platzi",
        "description": "I'm studying at Platzi because I want to become a software dev."
      },
      {
        "title": "Udemy",
        "description": "Javascript dev"
      },
      {
        "title": "Udemy",
        "description": "Typescript dev"
      }
    ],
    "experience": [
      {
        "title": "Frontend Engineer at Aplazo (CDMX)",
        "description": "As a Aplazo Front end Engineer, I take a place in B2B development team. I work mainly with the Angular framework to develop the dashboard of the merchants, In the last refactoring I take a code that was highly coupled to the framework for a better approach by splitting the domain into its own library, free of frameworks and defining use-cases to maintain and scale the app in the future."
      },
      {
        "title": "Frontend Dev at Coconutt (CDMX)",
        "description": "Most of my participation was on creating custom frontend web applications for the customers (final users). In my day to day I was involved working with Vue, Angular and clean architectures to build dashboards, SPA's, landing pages and improve some projects that was built before my arrived. For example we can built a landing page with template engines, vanilla Javascript, SASS and bundled the app with webpack, but for other projects we built on top of Angular framework and used CD with docker images and GH actions to accomplished the task."
      },
      {
        "title": "Freelance (CDMX)",
        "description": "I am focused on building and developing web applications for my clients. Recently I start to use Laravel as tool that let me to do my job. I mainly work with Javascript technologies and I can say that I work effortlessly with frameworks like Laravel, Express, Hapi.js, Angular, Ionic, Vue.js and Quasar. My learning roots include HTML, CSS, Vanilla Javascript, Typescript y Git, and in my day to day, I handle tools such as Webpack, Pug, SASS, RxJS, Jest."
      }
    ],
    "skills": [
      {
        "content": "HTML5"
      },
      {
        "content": "CSS"
      },
      {
        "content": "JavaScript"
      },
      {
        "content": "OOP"
      },
      {
        "content": "Angular"
      },
      {
        "content": "Vue"
      },
      {
        "content": "RxJs"
      },
      {
        "content": "Node"
      },
      {
        "content": "Python"
      },
      {
        "content": "PHP"
      },
      {
        "content": "React"
      }
    ],
    "interest": [
      { "content": "Javascript" },
      { "content": "Typescript" },
      { "content": "Backend" },
      { "content": "Front end" }
    ],
    "languages": [
      {
        "content": "Spanish"
      },
      {
        "content": "English"
      },
      {
        "content": "Italian"
      }
    ],
    "social": [
      {
        "name": "facebook",
        "url": "https://facebook.com/"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/"
      },
      {
        "name": "github",
        "url": "https://github.com/"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/"
      }
    ]
  }
}
